jmeter/results/before_100/report/statistics.json
{
  "GET /user/search" : {
    "transaction" : "GET /user/search",
    "sampleCount" : 4265,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1302.2736225087915,
    "medianResTime" : 1441.0,
    "minResTime" : 33.0,
    "maxResTime" : 2395.0,
    "pct1ResTime" : 1935.0,
    "pct2ResTime" : 2019.0,
    "pct3ResTime" : 2176.34,
    "throughput" : 70.24854643980696,
    "receivedKBytesPerSec" : 315.1519656261838,
    "sentKBytesPerSec" : 18.503553604664567
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4265,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1302.2736225087915,
    "medianResTime" : 1441.0,
    "minResTime" : 33.0,
    "maxResTime" : 2395.0,
    "pct1ResTime" : 1935.0,
    "pct2ResTime" : 2019.0,
    "pct3ResTime" : 2176.34,
    "throughput" : 70.24854643980696,
    "receivedKBytesPerSec" : 315.1519656261838,
    "sentKBytesPerSec" : 18.503553604664567
  }
}